In [21]:
import pandas as pd

In [22]:
df = pd.read_csv("one_homeprices.csv")
df

       town  area   price
0   kolkata  2600  550000
1   kolkata  3000  565000
2   kolkata  3200  610000
3   kolkata  3600  680000
4   kolkata  4000  725000
5    mumbai  2600  585000
6    mumbai  2800  615000
7    mumbai  3300  650000
8    mumbai  3600  710000
9     delhi  2600  575000
10    delhi  2900  600000
11    delhi  3100  620000
12    delhi  3600  695000

In [23]:
dummies = pd.get_dummies(df.town)
dummies

    delhi  kolkata  mumbai
0       0        1       0
1       0        1       0
2       0        1       0
3       0        1       0
4       0        1       0
5       0        0       1
6       0        0       1
7       0        0       1
8       0        0       1
9       1        0       0
10      1        0       0
11      1        0       0
12      1        0       0

In [24]:
merged = pd.concat([df,dummies],axis='columns')
merged

       town  area   price  delhi  kolkata  mumbai
0   kolkata  2600  550000      0        1       0
1   kolkata  3000  565000      0        1       0
2   kolkata  3200  610000      0        1       0
3   kolkata  3600  680000      0        1       0
4   kolkata  4000  725000      0        1       0
5    mumbai  2600  585000      0        0       1
6    mumbai  2800  615000      0        0       1
7    mumbai  3300  650000      0        0       1
8    mumbai  3600  710000      0        0       1
9     delhi  2600  575000      1        0       0
10    delhi  2900  600000      1        0       0
11    delhi  3100  620000      1        0       0
12    delhi  3600  695000      1        0       0

In [25]:
final = merged.drop(['town'], axis='columns')
final

    area   price  delhi  kolkata  mumbai
0   2600  550000      0        1       0
1   3000  565000      0        1       0
2   3200  610000      0        1       0
3   3600  680000      0        1       0
4   4000  725000      0        1       0
5   2600  585000      0        0       1
6   2800  615000      0        0       1
7   3300  650000      0        0       1
8   3600  710000      0        0       1
9   2600  575000      1        0       0
10  2900  600000      1        0       0
11  3100  620000      1        0       0
12  3600  695000      1        0       0

In [27]:
final = final.drop(['delhi'], axis='columns')
final

    area   price  kolkata  mumbai
0   2600  550000        1       0
1   3000  565000        1       0
2   3200  610000        1       0
3   3600  680000        1       0
4   4000  725000        1       0
5   2600  585000        0       1
6   2800  615000        0       1
7   3300  650000        0       1
8   3600  710000        0       1
9   2600  575000        0       0
10  2900  600000        0       0
11  3100  620000        0       0
12  3600  695000        0       0

In [28]:
X = final.drop('price', axis='columns')
X

    area  kolkata  mumbai
0   2600        1       0
1   3000        1       0
2   3200        1       0
3   3600        1       0
4   4000        1       0
5   2600        0       1
6   2800        0       1
7   3300        0       1
8   3600        0       1
9   2600        0       0
10  2900        0       0
11  3100        0       0
12  3600        0       0

In [29]:
y = final.price

In [30]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [31]:
model.fit(X,y)

LinearRegression()

In [32]:
model.predict(X) # 2600 sqr ft home in new jersey

array([539709.73984091, 590468.71640508, 615848.20468716, 666607.18125133,
       717366.1578155 , 579723.71533005, 605103.20361213, 668551.92431735,
       706621.15674048, 565396.15136531, 603465.38378844, 628844.87207052,
       692293.59277574])

In [33]:
model.score(X,y)

0.9573929037221872

In [34]:
model.predict([[3400,0,0]]) # 3400 sqr ft home in west windsor

array([666914.10449365])

In [35]:
model.predict([[2800,0,1]]) # 2800 sqr ft home in robbinsville

array([605103.20361213])

In [36]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [37]:
dfle = df
dfle.town = le.fit_transform(dfle.town)
dfle

    town  area   price
0      1  2600  550000
1      1  3000  565000
2      1  3200  610000
3      1  3600  680000
4      1  4000  725000
5      2  2600  585000
6      2  2800  615000
7      2  3300  650000
8      2  3600  710000
9      0  2600  575000
10     0  2900  600000
11     0  3100  620000
12     0  3600  695000

In [38]:
X = dfle[['town','area']].values

In [39]:
X

array([[   1, 2600],
       [   1, 3000],
       [   1, 3200],
       [   1, 3600],
       [   1, 4000],
       [   2, 2600],
       [   2, 2800],
       [   2, 3300],
       [   2, 3600],
       [   0, 2600],
       [   0, 2900],
       [   0, 3100],
       [   0, 3600]], dtype=int64)

In [40]:
y = dfle.price.values
y

array([550000, 565000, 610000, 680000, 725000, 585000, 615000, 650000,
       710000, 575000, 600000, 620000, 695000], dtype=int64)

Now use one hot encoder to create dummy variables for each of the town

In [41]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
ct = ColumnTransformer([('town', OneHotEncoder(), [0])], remainder = 'passthrough')

In [42]:
X = ct.fit_transform(X)
X

array([[0.0e+00, 1.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.0e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.2e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.6e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 4.0e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 2.8e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.3e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 2.9e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.1e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.6e+03]])

In [43]:
X = X[:,1:]

In [44]:
X

array([[1.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 3.0e+03],
       [1.0e+00, 0.0e+00, 3.2e+03],
       [1.0e+00, 0.0e+00, 3.6e+03],
       [1.0e+00, 0.0e+00, 4.0e+03],
       [0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 2.8e+03],
       [0.0e+00, 1.0e+00, 3.3e+03],
       [0.0e+00, 1.0e+00, 3.6e+03],
       [0.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 2.9e+03],
       [0.0e+00, 0.0e+00, 3.1e+03],
       [0.0e+00, 0.0e+00, 3.6e+03]])

In [45]:
model.fit(X,y)

LinearRegression()

In [46]:
model.predict([[0,1,3400]]) # 3400 sqr ft home in west windsor

array([681241.6684584])

In [29]:
model.predict([[1,0,2800]]) # 2800 sqr ft home in robbinsville

array([590775.63964739])